#include "cmd.h"
#include "../fs/fs.h"
#include <iostream>
using namespace std;

/**
 * @brief		help命令
 * @author		Peter
 * @date		2024-06
 */


int cmd_help(int argc,char* argv[])
{
    if (argc==1)//展示所有命令
    {
        cout<<"--------------------------------------------------------------------------\n";
        cout<<"本文件操作系统存在以下操作命令：\n";
        cout<<"adduser     \n";
        cout<<"bash        <filename>\n";
        cout<<"cat         <filename>\n";
        cout<<"cd          <directory>\n";
        cout<<"chmod       <num> <directory>/<filename>/<link>\n";
        cout<<"chgroup     <uid> <gid>\n";
        cout<<"chpasswd    \n";
        cout<<"cl          <filedescriptor>\n";
        cout<<"cp          <directory>/<filename>/<link>    <path> \n";
        cout<<"create      <filename>\n";
        cout<<"format      \n";
        cout<<"ht          \n";
        cout<<"help        (<command>)\n";
        cout<<"hlk         <linkedfile> <newfile>\n";
        cout<<"login       \n";
        cout<<"logout      \n";
        cout<<"ls          \n";
        cout<<"mkdir       <newdirname>\n";
        cout<<"open        <filename> <openmode>\n";
        cout<<"pof         \n";
        cout<<"pu          \n";
        cout<<"read        <filedescriptor>\n";
        cout<<"rename      <filename> <newfilename>\n";
        cout<<"rdlk        <link>\n";
        cout<<"rm          [-r/rf] <path>\n";
        cout<<"rmdir       <directory>\n";
        cout<<"rmfile      <filename>\n";
        cout<<"save        <filename> <textnum> <text>\n";
        cout<<"urename     <username>\n";
        cout<<"writer      <filename>\n";
        cout<<"slk         <source> <linkname>\n";
        cout<<"su          <username> \n";
        cout<<"\n";
        cout<<"--------------------------------------------------------------------------\n";
    }
    else if(argc ==2)//展示某条指令的用法
    {
        if(strcmp("adduser",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"adduser \n";
            cout<<"\t用于添加用户，仅root用户有此权限。\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("bash",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"bash\t<filename>\n";
            cout<<"\t用于执行文件内容。\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("cat",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"cat\t<filename>\n";
            cout<<"\t将文件内容打印至终端\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("cd",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"cd\t<directory>\n";
            cout<<"\t进入指定路径\n";
            cout<<"\t<directory>:路径\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("chmod",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"chmod\t<num> <directory>/<filename>/<link>\n";
            cout<<"\t给予指定文件权限\n";
            cout<<"\t<num>:权限模式。777：全部允许；000：全不允许\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"\t<directory>:目录名\n";
            cout<<"\t<link>:软连接名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("chgroup",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"chgroup\t<uid> <gid>\n";
            cout<<"\t修改用户所属用户组，仅root用户可操作\n";
            cout<<"\t<uid>:用户id\n";
            cout<<"\t<gid>:新的分组号\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("chpasswd",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"chpasswd   \n";
            cout<<"\t修改密码\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("cl",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"cl\t<filedescriptor>\n";
            cout<<"\t关闭文件\n";
            cout<<"\t<filedescriptor>:文件描述符\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("cp",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"cp\t<directory>/<filename>/<link>    <path>\n";
            cout<<"\t将指定内容复制到指定路径,支持复目录到目录的复制\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"\t<directory>:目录名\n";
            cout<<"\t<link>:链接名\n";
            cout<<"\t<path>:目标路径名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("create",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"create\t<filename>\n";
            cout<<"\t创建文件\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("format",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"format      \n";
            cout<<"\t系统格式化\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("ht",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"ht\n";
            cout<<"\t系统保存退出\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("help",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"help\n";
            cout<<"\t若无额外参数，显示所有的指令及其格式\n";
            cout<<"\t若有额外参数，则显示指定参数的指令格式及其详细说明\n";
            cout<<"\t<command>:指令名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("hlk",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"hlk\t<linkedfile> <newfile>\n";
            cout<<"\t创建指定文件的硬链接\n";
            cout<<"\t<linkedfile>:被链接的文件名\n";
            cout<<"\t<newfile>:新链接名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("login",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"login\n";
            cout<<"\t用户登入\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("logout",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"logout\n";
            cout<<"\t用户登出\n";
            cout<<"--------------------------------------------------------------------------\n";
        }      
        else if(strcmp("ls",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"ls\n";
            cout<<"\t打印当前目录下的内容\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("mkdir",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"mkdir\t<newdirname>\n";
            cout<<"\t在当前目录下新建目录\n";
            cout<<"\t<newdirname>:新目录名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("open",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"open\t<filename> <openmode>\n";
            cout<<"\t打开文件\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"\t<openmode>:打开模式，包括‘r‘,’w’,'a','+'\n";
            cout<<"\t\t'r':只读模式\n";
            cout<<"\t\t'w':只写模式\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("pof",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"pof\t\n";
            cout<<"\t打印所有已打开的文件\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("pu",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"pu\t\n";
            cout<<"\t打印所有用户信息\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("read",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"read\t<filedescriptor>\n";
            cout<<"\t读取文件内容\n";
            cout<<"\t<filedescriptor>:文件描述符\n";
            cout<<"--------------------------------------------------------------------------\n";
        }     
        else if(strcmp("rename",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"rename\t<filename> <newfilename>\n";
            cout<<"\t文件重命名\n";
            cout<<"\t<filename>:原文件名\n";
            cout<<"\t<newfilename>:新文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("rdlk",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"rdlk\t<link>\n";
            cout<<"\t读取链接内容\n";
            cout<<"\t<link>:链接名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("rm",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"rm\t[-r/rf] <path>\n";
            cout<<"\t删除\n";
            cout<<"\t<path>:删除路径的指定内容\n";
            cout<<"\t[-r/rf]为可选参数，代表递归删除\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("rmdir",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"rmdir\t<directory>\n";
            cout<<"\t删除空目录\n";
            cout<<"\t<directory>:目录名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("rmfile",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"rmfile\t<filename>\n";
            cout<<"\t删除文件\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("save",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"save\t<filename> <textnum> <text>\n";
            cout<<"\t将指定文本保存至指定文件内\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"\t<text>:文本\n";
            cout<<"\t<textnum>:文本字节数\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("urename",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"urename\t<username>\n";
            cout<<"\t将当前用户名修改为指定名称\n";
            cout<<"\t<username>:用户名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("writer",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"writer\t<filename>\n";
            cout<<"\t编辑指定文件的内容，若文件不存在则直接新建文件\n";
            cout<<"\t<filename>:文件名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("slk",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"slk\t<source> <linkname>\n";
            cout<<"\t创建指定源的软连接\n";
            cout<<"\t<source>:源，可以是文件名，也可以是目录\n";
            cout<<"\t<linkname>:软连接名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("su",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"su\t<username> \n";
            cout<<"\t切换到指定用户\n";
            cout<<"\t<username>:用户名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
        else if(strcmp("sudo",argv[1])==0)
        {
            cout<<"--------------------------------------------------------------------------\n";
            cout<<"su\t<username> \n";
            cout<<"\t切换到指定用户\n";
            cout<<"\t<username>:用户名\n";
            cout<<"--------------------------------------------------------------------------\n";
        }
    }
    else if(argc >2)//参数过多，报错
    {
        cout << "不支持的指令，请输入 \"help help\" 查看 help 指令用法" << endl;
    }
    return 0;
}